Analysis of a straight tube/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    entrada
    {
        type            patch;
        physicalType    patch;
        nFaces          223;
        startFace       13601;
    }
    paredes
    {
        type            patch;
        physicalType    patch;
        nFaces          1624;
        startFace       13824;
    }
    salida
    {
        type            patch;
        physicalType    patch;
        nFaces          67;
        startFace       15448;
    }
)

// ************************************************************************* //
